## Промежуточный зачет по прикладному программированию на Python

### Часть 1: Программирование на Python

Что будет выведено на экран в следующих программах:

```python
a = 10 / 4 * 2
b = 13 % 4 // 2
print((a + b) ** 3)
```
---
```python
v = int(input())
s = "Вася любит {0}"
if v and not True:
    print(s.format("кодить"))
elif v or True:
    print(s.format("спать"))
else:
    print(s.format("гулять"))
```
---
```python
for i in range(1,10,2):
    print("*" * i)
```
---
```python
s = 0
a = 0
b = 1
while b < 13:
    s += a
    a, b = b, a + b
print(s)
```
---
```python
animals = ['cow', 'camal', 'pig', 'frog', 'horse', 'goat']
for animal in animals:
    if len(animal) > 4:
        print(animal[::-1])
```
---
```python
sentence = "Мама мыла раму"
sentence = sentence.lower().replace("м", "п")
print(sentence[:4] + sentence[10:])
```
---
```python
d = {}
list = [1, 2, 3, 3, -45, 23, 6, 23, 3]
for elem in list:
    if elem in d.keys():
        d[elem] += 1
    else:
        d[elem] = 1
print(d[3])
```
---
```python
matr = [
    [1, 2, 3],
    [1, 5, 2],
    [3, 2, 1]
]
p = 1
for l in matr:
    p *= sum(l)
print(p)
```
### Часть 2: Теория

1. Чем различаются списки, словари, кортежи и множества?
2. Сколько памяти займет несжатое полноцветное изображение размером 1500 на 1000?
3. Чем цикл while отличается от for? Зачем нужна команда break?

### Часть 2: Прикладное программирование

1. Добавление шума: реализуйте фотофильтр, который умножает каждый пиксель на случайное число (по модулю 256) и совмещает полученное изображение с исходным с 50% прозрачностью.

2. Заевшая пластинка: напишите программу, которая открывает произвольный одноканальный wav файл, замедляет его на 30% и воспроизводит.

3. Напишите телеграм бота для игры в висилицу.





