## Промежуточный зачет по курсу "Питон для начинающих"

### Задание 1 (40 баллов)

В заданиях ниже вам нужно написать, что компьютер выведет на экран после запуска программы. Писать можно прямо на этих листках. Каждое задание стоит 5 баллов.

```python

A = 5 + 10
print(A)

B = A / 2
print(B)

C = B * 3 // 2
print(C)

D = C % 3
print(D)

E = D ** 2
print(E)
```
---

```python
A = 5
B = 17

if A + B % 2 == 0:
    print(A)
elif (A + B) % 3 == 0:
    print(A * 2)
else:
    print(A * 3)
```
---
```python
weather = 22
rain = "no"

if weather > 25:
    print("го в футбол")
else:
    if weather > 20 and rain == "no":
        print("го гулять!")
    else:
        print("го в фортнайт!")
```

---
С какой вероятность программа выведет слово *джекпот*?:
```python
import random
if random.randint(1,100) > 30:
  print("джекпот")
else:
  print("кот в мешке")
```
---

```python
def my_func(a):
  print('*' * a)
  
my_func(1)
my_func(2)
my_func(3)
```
---

Будет ли работать эта программа? Если нет, то как ее исправить?

```python
def my_func():
  a += 15
  
a = 5
my_func()
print(a)
```
---
```python
i = 1
while i < 10:
    print("*" * i)
    i += 2
```
---
```python
s = 0
a = 0
b = 1
while b < 13:
    s += a
    c = a
    a = b
    b = b + c
print(s)
```

# .
# .

_В заданиях 2 и 3 вы можете брать подсказки. Каждая подсказка "стоит" 5 баллов._

### Задание 2 (10 баллов)

Вы играли в Flappy Bird? В этой игре птичке нужно преодолевать препятствия, пролетая между двух преград. Вам нужно написать такую же игру, только пока без графики. В каждый момент времени вводятся три числа - границы проема и позиция птички по вертикали. Игра заканчивается, когда птица в проем не пролезает. Нужно вывести, сколько было набрано очков!

<table>
<tr><td>Ввод (жирный выделена координата птицы)</td><td>Вывод</td></tr>
<tr><td>
 1 <b>2</b> 3<br>
 4 <b>5</b> 6<br>
 6 <b>2</b> 9<br>
 </td><td>2</td></tr>
<tr><td>
 100 <b>101</b> 110<br>
 100 <b>100</b> 110
 </td><td>1</td></tr>
</table>


### Задание 3 (15 баллов)

Напишите программу, которая запрашивает у пользователя путь к картинке, вычисляет **средний цвет пикселя** на этой картинке, а затем полностью закрашивает картинку этим цветом и выводит на экран.

Например, картинка с морем, в теории, должна стать синим квадратом.

